In [49]:
people = {
    "first": ["Kiyo", 'Jane', 'John'], 
    "last": ["Ndux", 'Doe', 'Doe'], 
    "email": ["rmvilla987@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [50]:
import pandas as pd

In [51]:
df = pd.DataFrame(people)

In [52]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [53]:
df.columns = ['first_name', 'last_name', 'email']

In [54]:
df

  first_name last_name                 email
0       Kiyo      Ndux  rmvilla987@gmail.com
1       Jane       Doe     JaneDoe@email.com
2       John       Doe     JohnDoe@email.com

In [55]:
df.columns = [x.lower() for x in df.columns]

In [56]:
df

  first_name last_name                 email
0       Kiyo      Ndux  rmvilla987@gmail.com
1       Jane       Doe     JaneDoe@email.com
2       John       Doe     JohnDoe@email.com

In [57]:
df.columns = df.columns.str.replace(' ', '_')
df

  first_name last_name                 email
0       Kiyo      Ndux  rmvilla987@gmail.com
1       Jane       Doe     JaneDoe@email.com
2       John       Doe     JohnDoe@email.com

In [58]:
df.rename(columns={'first_name':'first', 'last_name':'last'}, inplace=True)

In [59]:
df.loc[2] = ['Rm', 'Villa', 'kiyo@gmail.com']

In [60]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [61]:
df

  first  last                 email
0  Kiyo  Ndux  rmvilla987@gmail.com
1  Jane   Doe     JaneDoe@email.com
2    Rm   Doe     JohnDoe@email.com

In [62]:
df.loc[2, 'first'] = 'John'

In [63]:
df

  first  last                 email
0  Kiyo  Ndux  rmvilla987@gmail.com
1  Jane   Doe     JaneDoe@email.com
2  John   Doe     JohnDoe@email.com

In [64]:
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]['last'] = 'Smith'

C:\Users\PC\AppData\Local\Temp\ipykernel_7612\1842663546.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [65]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [69]:
df['email'] = df['email'].str.lower()

In [70]:
df

  first   last                 email
0  Kiyo   Ndux  rmvilla987@gmail.com
1  Jane    Doe     janedoe@email.com
2  John  Smith     johndoe@email.com

In [71]:
df['email'].apply(len)

0    20
1    17
2    17
Name: email, dtype: int64

In [72]:
def update_email(email):
    return email.upper()

In [73]:
df['email'].apply(update_email)

0    RMVILLA987@GMAIL.COM
1       JANEDOE@EMAIL.COM
2       JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [74]:
df['email'] = df['email'].apply(update_email)

In [75]:
df

  first   last                 email
0  Kiyo   Ndux  RMVILLA987@GMAIL.COM
1  Jane    Doe     JANEDOE@EMAIL.COM
2  John  Smith     JOHNDOE@EMAIL.COM

In [76]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [77]:
df

  first   last                 email
0  Kiyo   Ndux  rmvilla987@gmail.com
1  Jane    Doe     janedoe@email.com
2  John  Smith     johndoe@email.com

In [81]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [82]:
len(df['email'])

3

In [83]:
df.apply(pd.Series.min)

first                 Jane
last                   Doe
email    janedoe@email.com
dtype: object

In [85]:
df.apply(lambda x: x.max())

first                    Kiyo
last                    Smith
email    rmvilla987@gmail.com
dtype: object

In [87]:
df

  first   last                 email
0  Kiyo   Ndux  rmvilla987@gmail.com
1  Jane    Doe     janedoe@email.com
2  John  Smith     johndoe@email.com

In [92]:
Data.applymap(len)

NameError: name 'Data' is not defined

In [93]:
df.applymap(str.lower)

C:\Users\PC\AppData\Local\Temp\ipykernel_7612\357608748.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower)

  first   last                 email
0  kiyo   ndux  rmvilla987@gmail.com
1  jane    doe     janedoe@email.com
2  john  smith     johndoe@email.com

In [94]:
df['first'].map({'Kiyo':'Rm', 'Jane':'Mary'})

0      Rm
1    Mary
2     NaN
Name: first, dtype: object

In [96]:
df['first'] = df['first'].replace({'Kiyo':'Rm', 'Jane':'Mary'})

In [97]:
df

  first   last                 email
0    Rm   Ndux  rmvilla987@gmail.com
1  Mary    Doe     janedoe@email.com
2  John  Smith     johndoe@email.com